from aiogram.types import ReplyKeyboardMarkup, KeyboardButton 

facts_menu = ReplyKeyboardMarkup(
    keyboard=[
        [KeyboardButton(text="🏋️ Бодибилдинг")],
        [KeyboardButton(text="💪 Мышцы")],
        [KeyboardButton(text="🥗 Питание")],
        [KeyboardButton(text="🏆 Чемпионы")],
        [KeyboardButton(text="🧬 Организм")],
        [KeyboardButton(text="❓ Миф или Правда")],
        [KeyboardButton(text="🎲 Случайный факт")],
        [KeyboardButton(text="⬅️ Главное меню")]
    ],
    resize_keyboard=True
)
import random

bodybuilding = [

"Арнольд Шварценеггер начинал заниматься бодибилдингом в 15 лет.",

"Ронни Коулман выполнял приседания и становую тягу с весом более 360 кг.",

"Самая престижная награда в бодибилдинге — Mr. Olympia.",

"Во время подготовки к соревнованиям бодибилдеры могут значительно снижать процент жира, однако такие методы требуют осторожности и профессионального контроля.",

"Дориан Йейтс популяризировал высокоинтенсивный стиль тренировок."

]

muscles = [

"Самая большая мышца человека — большая ягодичная.",

"Сердце тоже является мышцей.",

"В теле человека более 600 мышц.",

"Икроножные мышцы работают практически каждый день.",

"Мышцы способны адаптироваться к увеличению нагрузки при регулярных тренировках."

]

nutrition = [

"Белок помогает восстанавливаться после тренировок.",

"Углеводы являются важным источником энергии для интенсивной физической активности.",

"Вода необходима для нормальной работы мышц.",

"Дефицит калорий способствует снижению массы тела.",

"Омега-3 участвуют во многих процессах организма и могут быть частью сбалансированного рациона."

]

champions = [

"Арнольд Шварценеггер семь раз выигрывал Mr. Olympia.",

"Ронни Коулман — восьмикратный победитель Mr. Olympia.",

"Ли Хейни также восемь раз выигрывал Mr. Olympia.",

"Крис Бамстед несколько лет подряд побеждал в категории Classic Physique.",

"Фил Хит завоевал семь титулов Mr. Olympia."

]

body = [

"Во время сна происходит активное восстановление организма.",

"Рост мышц происходит в период восстановления после нагрузки.",

"Регулярные силовые тренировки повышают эффективность работы нервно-мышечной системы.",

"Организм постоянно обновляет мышечные белки.",

"Даже небольшая физическая активность полезнее полного отсутствия движения."

]

myths = [

"❌ Миф: жир превращается в мышцы.",

"❌ Миф: пресс появляется только благодаря упражнениям на пресс.",

"❌ Миф: чем больше тренируешься, тем быстрее растут мышцы.",

"❌ Миф: без спортивного питания невозможно набрать мышечную массу.",

"❌ Миф: боль после тренировки всегда означает эффективную тренировку."

]